; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-5packages-707seed

(define (problem transport-two-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-5packages-707seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 343,527 -> 18,620
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 34)
  ; 18,620 -> 343,527
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 34)
  ; 343,527 -> 647,951
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 53)
  ; 647,951 -> 343,527
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 53)
  ; 766,546 -> 647,951
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 43)
  ; 647,951 -> 766,546
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 43)
  ; 766,546 -> 343,527
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 43)
  ; 343,527 -> 766,546
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 43)
  ; 474,677 -> 18,620
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 46)
  ; 18,620 -> 474,677
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 46)
  ; 474,677 -> 647,951
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 33)
  ; 647,951 -> 474,677
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 33)
  ; 474,677 -> 343,527
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 20)
  ; 343,527 -> 474,677
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 20)
  ; 474,677 -> 766,546
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 32)
  ; 766,546 -> 474,677
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 32)
  ; 2540,570 -> 2001,518
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 55)
  ; 2001,518 -> 2540,570
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 55)
  ; 2540,570 -> 2906,940
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 52)
  ; 2906,940 -> 2540,570
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 52)
  ; 2857,675 -> 2906,940
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 27)
  ; 2906,940 -> 2857,675
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 27)
  ; 2857,675 -> 2540,570
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 34)
  ; 2540,570 -> 2857,675
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 34)
  ; 2941,313 -> 2906,940
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 63)
  ; 2906,940 -> 2941,313
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 63)
  ; 2941,313 -> 2540,570
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 48)
  ; 2540,570 -> 2941,313
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 48)
  ; 2941,313 -> 2857,675
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 38)
  ; 2857,675 -> 2941,313
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 38)
  ; 766,546 <-> 2001,518
  (road city-1-loc-4 city-2-loc-1)
  (= (road-length city-1-loc-4 city-2-loc-1) 124)
  (road city-2-loc-1 city-1-loc-4)
  (= (road-length city-2-loc-1 city-1-loc-4) 124)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-4)
  (at package-3 city-1-loc-4)
  (at package-4 city-1-loc-1)
  (at package-5 city-1-loc-1)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-4)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-4)
  (at package-5 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-1-loc-4)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 5
2. (pick-up truck-2 city-1-loc-4 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-1-loc-4) (capacity truck-2 capacity-4)
   added: (in package-2 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 5
3. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 5
4. (drive truck-2 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 5
5. (pick-up truck-2 city-1-loc-1 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-1-loc-1) (capacity truck-2 capacity-3)
   added: (in package-5 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 5
6. (pick-up truck-2 city-1-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 5
7. (pick-up truck-2 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 5
8. (drive truck-1 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 5
9. (drive truck-1 city-2-loc-1 city-1-loc-4)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
10. (pick-up truck-1 city-1-loc-4 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-4) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 5
11. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 5
12. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 5
13. (drive truck-2 city-1-loc-4 city-2-loc-1)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 5
14. (drive truck-2 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 5
15. (drive truck-1 city-1-loc-4 city-2-loc-1)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 5
16. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 5
17. (drop truck-1 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 1 of 5
18. (drop truck-2 city-2-loc-3 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-0)
   added: (at package-1 city-2-loc-3) (capacity truck-2 capacity-1)
   goals met: 2 of 5
19. (drive truck-2 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-4)
   goals met: 2 of 5
20. (drop truck-2 city-2-loc-4 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-1)
   added: (at package-2 city-2-loc-4) (capacity truck-2 capacity-2)
   goals met: 3 of 5
21. (drop truck-2 city-2-loc-4 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-2)
   added: (at package-4 city-2-loc-4) (capacity truck-2 capacity-3)
   goals met: 4 of 5
22. (drop truck-2 city-2-loc-4 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-3)
   added: (at package-5 city-2-loc-4) (capacity truck-2 capacity-4)
   goals met: 5 of 5
